{
  "ai_data_engineering": [
    {
      "url": "https://www.youtube.com/watch?v=1xgyd3v4EWs",
      "title": "How AWS Keeps Your Data Untouchable",
      "summary": "How does AWS protect customer data at the hardware level, and why does it matter for cloud sovereignty?\n\nIn this interview, I talk with Colm MacCarthaigh, Vice President & Distinguished Engineer at @amazonwebservices about the AWS Nitro System — the “behind-the-scenes” architecture that powers EC2 and helps enforce isolation, encryption, and privacy by design.\n\nWe cover:\n✅ What Nitro is and how it works (“servers inside of servers”)\n✅ Hardware-level isolation + encrypted networking and storage\n✅ Why there’s no operator access to customer data\n✅ How this supports the AWS European Sovereign Cloud for sensitive workloads\n\n#ad #awspartner",
      "published_ts": 1769194804,
      "source_name": "Andreas Kretz (YouTube)",
      "content_type": "technical"
    },
    {
      "url": "https://www.dataiku.com/stories/blog/manufacturing-ai-trends-2026",
      "title": "Manufacturing's 2026 Mandate: From AI Pilot to Agentic Profit",
      "summary": "Hardware remains the backbone of the factory floor. But in 2026, a manufacturer's competitive edge will be defined by how effectively they deploy AI agents to orchestrate production and anticipate disruptions. We are seeing an acceleration from standalone AI experiments toward an agentic reality where digital resilience supports 24/7 operations. To help you understand how this and other shifts are reshaping the industry, we have compiled important  trends that you should understand to help you stay ahead.",
      "published_ts": 1769169600,
      "source_name": "Dataiku Blog",
      "content_type": "technical"
    },
    {
      "url": "https://stripe.com/blog/metronome-stripe-building-the-future-of-billing",
      "title": "Metronome + Stripe: Building the future of billing",
      "summary": "Together, Metronome and Stripe are building the most flexible and complete billing solution on the market—one that works for everyone, from engineers in a garage figuring out their business model to public companies monetizing at global scale.",
      "published_ts": 1769126400,
      "source_name": "Stripe Engineering Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.snowflake.com/content/snowflake-site/global/en/blog/advertising-media-predictions-2026",
      "title": "Agentic AI and the Future of Media & Advertising in 2026",
      "summary": "Explore how Agentic AI, composable architectures, and market disruption will reshape advertising, media, and entertainment in 2026.",
      "published_ts": 1769104560,
      "source_name": "Snowflake Blog",
      "content_type": "technical"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/accelerate-context-aware-data-analysis-and-ml-workflows-with-amazon-sagemaker-data-agent/",
      "title": "Accelerate context-aware data analysis and ML workflows with Amazon SageMaker Data Agent",
      "summary": "In this post, we demonstrate the capabilities of SageMaker Data Agent, discuss the challenges it addresses, and explore a real-world example analyzing New York City taxi trip data to see the agent in action.",
      "published_ts": 1769102702,
      "source_name": "Redshift / AWS Big Data",
      "content_type": "technical"
    },
    {
      "url": "https://blog.octo.com/jumeaux-numeriques-systemiques--modelisation-des-processus-industriels-et-des-activites",
      "title": "Jumeaux Numériques Systémiques : modélisation des processus industriels et des activités",
      "summary": "Premier d’une série consacrée aux Jumeaux Numériques Systémique (JNS), cet article montre comment l’annotation sémantique des transitions et états d’attente permet la modélisation nécessaire aux Jumeaux Numériques Systémiques dans un format compatible avec la représentation standard industrielle.Les articles suivants feront le lien entre la modél",
      "published_ts": 1769097310,
      "source_name": "OCTO Talks!",
      "content_type": "technical"
    },
    {
      "url": "https://www.dataiku.com/stories/blog/odalc",
      "title": "How ODALC Built a Governed AI Knowledge Agent to Open Architectural Research Access to Masses",
      "summary": "ODALC used AI agents in Dataiku to transform fragmented academic archives into a searchable, AI-powered research platform — cutting processing time by 80%, accelerating scholarship, and expanding access to Latin American architectural theory across students, researchers, and communities.",
      "published_ts": 1769093270,
      "source_name": "Dataiku Blog",
      "content_type": "technical"
    },
    {
      "url": "https://blog.ovhcloud.com/safety-first-detect-harmful-texts-using-an-ai-safeguard-agent/",
      "title": "Safety first: Detect harmful texts using an AI safeguard agent",
      "summary": "This article explains how to use the Qwen 3 Guard safeguard models provided by OVHCloud. Using this guide, you can analyse and moderate texts for LLM applications, chat platforms, customer support systems, or any other text-based services requiring safe and compliant interactions. Our focus will be on written content, such as conversations or plain text. […]",
      "published_ts": 1769078771,
      "source_name": "OVHcloud Blog",
      "content_type": "technical"
    },
    {
      "url": "https://blog.octo.com/le-developpement-logiciel-a-l'ere-des-agents-ia",
      "title": "Le développement logiciel à l’ère des agents IA",
      "summary": "Avec l’avènement de l’intelligence artificielle générative, le métier de développeur connaît une transformation profonde. Il ne s’agit plus uniquement d’écrire du code, mais d’orchestrer une production logicielle dans un environnement où plusieurs agents de génération collaborent en parallèle.",
      "published_ts": 1769056030,
      "source_name": "OCTO Talks!",
      "content_type": "technical"
    },
    {
      "url": "https://www.databricks.com/blog/driving-industry-outcomes-partner-ai-solutions",
      "title": "Driving Industry Outcomes with Partner AI Solutions",
      "summary": "Generative AI is transforming the way teams work across various industries. According...",
      "published_ts": 1769043600,
      "source_name": "Databricks Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.getdbt.com/blog/ade-bench-dbt-data-benchmarking",
      "title": "Introducing ADE-bench: measuring how AI agents perform data work",
      "summary": "Learn how ADE-bench leverages dbt to produce realistic data benchmarks against all popular LLMs and agents.",
      "published_ts": 1769025720,
      "source_name": "dbt Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.databricks.com/blog/announcing-blackice-containerized-red-teaming-toolkit-ai-security-testing",
      "title": "Announcing BlackIce: A Containerized Red Teaming Toolkit for AI Security Testing",
      "summary": "At CAMLIS Red 2025, we introduced BlackIce, an open-source, containerized toolkit...",
      "published_ts": 1769018400,
      "source_name": "Databricks Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.databricks.com/blog/basf-fox-simple-idea-global-genai-impact-and-digital-award-2025-winner",
      "title": "BASF FOX: From Simple Idea to Global GenAI Impact and Digital Award 2025 Winner",
      "summary": "FOX Wins the BASF Digital Award 2025FOX has been named the winner of the BASF Digital Award 2025...",
      "published_ts": 1769018400,
      "source_name": "Databricks Blog",
      "content_type": "technical"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/streamline-large-binary-object-migrations-a-kafka-based-solution-for-oracle-to-amazon-aurora-postgresql-and-amazon-s3/",
      "title": "Streamline large binary object migrations: A Kafka-based solution for Oracle to Amazon Aurora PostgreSQL and Amazon S3",
      "summary": "In this post, we present a scalable solution that addresses the challenge of migrating your large binary objects (LOBs) from Oracle to AWS by using a streaming architecture that separates LOB storage from structured data. This approach avoids size constraints, reduces Oracle licensing costs, and preserves data integrity throughout extended migration periods.",
      "published_ts": 1769017498,
      "source_name": "Redshift / AWS Big Data",
      "content_type": "technical"
    },
    {
      "url": "https://www.blog.langchain.com/building-multi-agent-applications-with-deep-agents/",
      "title": "Building Multi-Agent Applications with Deep Agents",
      "summary": "Breaking down complex tasks across specialized agents is one of the most effective approaches to building capable AI systems. In this post, we'll show you how to build multi-agent systems with Deep Agents.",
      "published_ts": 1769013000,
      "source_name": "LangChain Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.rudderstack.com/blog/cdps-2026-trustworthy-customer-context-for-ai",
      "title": "CDPs in 2026? Delivering trustworthy customer context for AI",
      "summary": "CDPs in 2026 will be judged by one thing: can they deliver trustworthy customer context for AI agents, not just unified profiles for marketing?",
      "published_ts": 1769010805,
      "source_name": "Rudderstack Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.youtube.com/watch?v=AeEzJNG26_Q",
      "title": "Hands-On Agentic Data Management With Acceldata",
      "summary": "The most annoying thing for engineers: getting hundreds of alerts and looking through endless dashboards to find issues! Why can't we just ask an AI what's wrong and how to fix it?\n \nWell, actually we can do exactly that. I recently tried out @acceldatainc 's Agentic Data Management Platform.\nAnd this is how every tool should work by now.\n\n➡️ Start with Acceldata's Agentic Data Management Platform for FREE right here:\nhttps://www.acceldata.io/?utm_source=datacated&utm_campaign=acceldata_datacated",
      "published_ts": 1769007630,
      "source_name": "Andreas Kretz (YouTube)",
      "content_type": "technical"
    },
    {
      "url": "https://www.dataiku.com/stories/blog/shadow-ai-agents-automation-debt",
      "title": "Why Shadow AI Agents Are Accumulating Automation Debt",
      "summary": "For many enterprises, AI risk still centers on unsanctioned prompts and shadow tools. But the next wave of risk is already emerging, driven by autonomous agents that can take action across systems with limited human oversight.",
      "published_ts": 1769007515,
      "source_name": "Dataiku Blog",
      "content_type": "technical"
    },
    {
      "url": "https://blog.octo.com/l'observabilite-au-temps-des-llm-apps-1",
      "title": "L'observabilité au temps des LLM apps",
      "summary": "Comprendre comment instrumenter, tracer et monitorer les applications basées sur des modèles LLM.",
      "published_ts": 1769001198,
      "source_name": "OCTO Talks!",
      "content_type": "technical"
    },
    {
      "url": "https://blog.zenika.com/2026/01/21/web3-le-bilan-de-google-cloud-sur-la-blockchain-en-2025/",
      "title": "Web3 : Le bilan de Google Cloud sur la blockchain en 2025",
      "summary": "Bilan 2025 de Google Cloud dans le Web3 : comment Google Cloud accélère dans le Web3 avec sa blockchain maison, son système de paiements numériques et l’essor des agents d’intelligence artificielle capables d’interagir avec les applications décentralisées.",
      "published_ts": 1768989019,
      "source_name": "Zenika Tech Blog",
      "content_type": "technical"
    },
    {
      "url": "https://huggingface.co/blog/ibm-research/assetopsbench-playground-on-hugging-face",
      "title": "AssetOpsBench: Bridging the Gap Between AI Agent Benchmarks and Industrial Reality",
      "summary": "AssetOpsBench: Bridging the Gap Between AI Agent Benchmarks and Industrial Reality\nAssetOpsBench\nis a comprehensive benchmark and evaluation system with six qualitative dimensions that bridges the gap for agentic AI in domain-specific settings, starting with industrial Asset Lifecycle Management.\nIn",
      "published_ts": 1768976731,
      "source_name": "Hugging Face Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.databricks.com/blog/building-responsible-and-calibrated-ai-agents-databricks-and-mlflow-real-world-use-case-deep",
      "title": "Building Responsible and Calibrated AI Agents with Databricks and MLflow: A Real-World Use Case Deep Dive",
      "summary": "AI is evolving faster than we expected. In just a few years, we’ve gone from prompt-driven...",
      "published_ts": 1768957200,
      "source_name": "Databricks Blog",
      "content_type": "rex"
    },
    {
      "url": "https://engineering.salesforce.com/how-agentforce-runs-secure-ai-agents-at-11-million-calls-per-day/",
      "title": "How Agentforce Runs Secure AI Agents at 11 Million Calls Per Day",
      "summary": "In our Engineering Energizers Q&A series, we highlight the engineering minds driving innovation across Salesforce. Today we meet Sahil Sobti, Lead Software Engineer on the Developer Access team, who builds and operates the access layer safeguarding Agentforce, directly managing over 11 million daily agent calls across production environments. Explore how the team defined clear protection […] The post How Agentforce Runs Secure AI Agents at 11 Million Calls Per Day appeared first on Salesforce Engineering Blog .",
      "published_ts": 1768956759,
      "source_name": "Salesforce Engineering",
      "content_type": "technical"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/how-bazaarvoice-modernized-their-apache-kafka-infrastructure-with-amazon-msk/",
      "title": "How Bazaarvoice modernized their Apache Kafka infrastructure with Amazon MSK",
      "summary": "Bazaarvoice is an Austin-based company powering a world-leading reviews and ratings platform. Our system processes billions of consumer interactions through ratings, reviews, images, and videos, helping brands and retailers build shopper confidence and drive sales by using authentic user-generated content (UGC) across the customer journey. In this post, we show you the steps we took to migrate our workloads from self-hosted Kafka to Amazon Managed Streaming for Apache Kafka (Amazon MSK). We walk you through our migration process and highlight the improvements we achieved after this transition.",
      "published_ts": 1768940706,
      "source_name": "Redshift / AWS Big Data",
      "content_type": "technical"
    },
    {
      "url": "https://analyticshour.io/2026/01/20/289-the-imperative-of-developing-business-acumen/",
      "title": "#289: The Imperative of Developing Business Acumen",
      "summary": "That darn data. It’s so complicated and fragmented and gap-filled and noisy that no amount of time is ever enough to truly get to the bottom of all of its complexity. As a result, it’s pretty easy to fill all of our time handling as much of that underlying data messiness as possible. At what cost, though? It’s easy for the analyst’s connection to the business to suffer as they get mired (too) deeply in the data and lose sight of the broader business needs. In this episode, the gang had a chat about business acumen—what it is, how to develop it, and why it’s a must-have for any data or analytics role. This episode’s Measurement Bite from show sponsor Recast is a brief explanation of identifiability—what it is and how to check for it using simulation—from Michael Kaminsky ! Links to Resources Mentioned in the Show (Book) Psychology of Intelligence Analysis by Richards J. Heuer, Jr. Harvard Business School Online Credential Of Readiness (CORe) program (Book) The Innovator’s Dilemma: The Revolutionary Book That Will Change the Way You Do Business by Clayton M. Christensen (Book) Humankind: A Hopeful History by Rutger Bregman (Book) Lord of the Flies by William Golding (Podcast Episode) The Real-Life Lord of the Flies on the Everything Everywhere Daily podcast (this is not the episode Tim referenced on the show, but he found it while trying to track that down) (Podcast Episode) Chaos on the Throughline podcast (possibly/probably the episode Tim was remembering…and it also references Humankind: A Hopeful History !) (Video) In the Long Run, Everything is a Fad: Benn Stancil (Small Data SF 2025) (Podcast) Knowledge Distillation Episode #4: Michael Helbling on 20 Years in the Trenches, Why Trust Is the Real Bottleneck, and The Difference Between Data Retrieval and Actual Analysis (Conference) DataTune Nashville – March 6-7, 2026, in Nashville, TN (Conference) Marketing Analytics Summit – April 28-29, 2026, in Santa Barbara, CA Commoncog Photo by Adeolu Eletu on Unsplash Episode Transcript 00:00:05.76 [Announcer]: Welcome to the Analytics Power Hour. Analytics topics covered conversationally and sometimes with explicit language. 00:00:14.56 [Michael Helbling]: Hi everyone, welcome. It’s the Analytics Power Hour and this is episode 289. There’s a comfortable trap that a lot of us in this industry could fall into. We spend hours debating the merits of different data tools, what the best visualization is for a data set, or whether our tracking pixels are firing just right. Data is our craft, and we love it. But there is a harsh reality, and it usually hits about three to five years into a career. You can build the most rigorous model or beautiful dashboard, but if you can’t explain how it actually helps the company drive revenue or reduce churn, it kind of doesn’t matter. We like to complain about how our business stakeholders lack data fluency. But maybe we need to flip the mirror and ask ourselves the hard question. Do we lack business literacy? So that’s what we’re going to talk about. Business acumen. Is it the missing link that turns a data analyst into an actual strategic partner? We’ll talk about it. And to do that, let me introduce my co-hosts, Val Crawl. Hi, Michael. Hey. And of course, Tim Wilson. Hello. Hello and welcome. And Moee Kisss. 00:01:27.32 [Moe Kiss]: Howdy, team. 00:01:28.68 [Michael Helbling]: Hey, and I’m Michael Helbling. All right. I think maybe to kick things off, we should start with like a brief intro to maybe a definition about what we mean when we say business acumen in the first place. Anybody want to take a first stab at it? 00:01:45.65 [Tim Wilson]: I think as we were thinking about this, the little light bulb that went on for me is there’s two types of business acumen and one of them being knowledge of business itself. This is how business, this is how finance works, this is balance sheet income statement, cash flows, marketing. four P’s and more whatever aspect of the business, which is kind of, this is something that you build over time and take throughout and are sort of truisms or practices in business. And then there’s another type of acumen, which is like knowledge of your business, the company you’re working for or with and understanding where they are unique, they all are doing, they overlap and that your business is operating in the context of the broader business, but there is what are the specific external and internal challenges that your business is facing. So to me, that’s, I don’t know if that’s a definition, but that’s kind of two flavors of it. 00:02:54.38 [Moe Kiss]: But if you had to pick, if you had to stack rank, Do you think one is more important than the other? 00:02:59.80 [Tim Wilson]: I feel like they leapfrog as they go along, because you can’t be super incredibly deep in one without being deep in the other. If you were trying to say, I’m just going to know everything about the organization I work for, at some point you’re going to run into the finance team who’s going to be talking about revenue recognition. 00:03:26.36 [Michael Helbling]: Yeah, because I think on the first level, the first one is concepts. So how does a P&L work? And then the second one is context. How does it work in our company? And maybe that would frame it like that. And I don’t know if I could pick, Moee, to your question, which of those is more important. I feel like you need both of those wherever you’re going to be if you’re going to really, truly own business acumen in the place where you are, where you work. 00:03:53.84 [Moe Kiss]: It’s funny, though. One of the things that my mind goes to is, is there also like a third category, which is like knowing your type of business, like your industry, right? So like you can have a really deep experience in like e-commerce or FMCG or, I don’t know, insurance or government or something. And that’s like a different type of knowledge and experience that you can apply as well. 00:04:17.17 [Michael Helbling]: Oh yeah. I think that’s true. I still boil that into the context, you know, awareness of how your business or your vertical works. 00:04:25.82 [Tim Wilson]: But I think that how you’re running is a good, the FMCG or CPG is a good example when you, the number of FMCG brands I’ve worked with who’ve said, we want to be like and they insert B2C retailer. And it’s like, well, yeah. And they’re like, yeah, all we need to do is get direct information about our individual buyers. I’m like, you’re selling soap. That’s where on earth would you have that permission? I mean, maybe that goes back to the concepts of saying, well, you’d understand what the limitations are in the context of this vertical and what you have to do instead. But as you’re talking, I just realized this week had a case where two completely different verticals, but both of them had a franchise model was kind of the way they were working, completely different spaces. And I was kind of like pleasantly surprised to realize that there were some similarities into how that sort of corporate franchisee relationship worked and was managed that was shockingly parallel. And I haven’t worked with that many franchises, but I was like, oh, wait a minute, does every brand that operates on a franchise model or do most of them have this sort of setup. And that went from learning it for one and then kind of stumbling across it for another. But applying those patterns, which I think, Michael, you’re having those concepts and saying, okay, how does that concept apply in this specific context is a, I love that phrasing. 00:06:08.26 [Moe Kiss]: It’s funny though, the one thought I do have about knowledge of your business. Well, I have multiple thoughts. One is, I suppose the first being, it can really unlock a lot in terms of, let’s say hypothetically, you’re talking about maturity or data usage and how great it is in the company. You ask folks to give you a score of zero to 10, right? Zero totally should house and 10 being amazing industry leading. most data-driven, I’ve got air quotes for those listening along, company in the world. And it’s like, you might have knowledge that actually your company can only get to an eight, like a 10 is just not possible at your company for various factors. But it’s interesting because at the same time I say that, I also think it can danger the work that you do and how you provide it sometimes by absolutely biasing your approach. Like you think of Richard Harris’ book, The Psychology of Intelligence Analysis, and for that reason they tell analysts to move around because if you know something too well, you can also make mistakes. 00:07:12.87 [Michael Helbling]: I think, Moe, that’s an incredible point because it’s very natural for people to get locked in on whatever function they’re in. As analysts, it’s an amazing experience to see different parts of the business and build context around those and see how they work together and build out knowledge across. Finance and the way they look and analyze data is different than how marketing does versus how merchandising does versus how sales does. All these different functions within the business look at it different ways. You can become a much more fully featured business analyst by taking time in each of those. You can sometimes get a little bit too I don’t want to say stuck, but there’s a bias that can influence how you even approach or think about what’s possible in terms of insight or action or recommendation that then leaves your analysis not as fresh or aggressive enough. I don’t know the right way to say that good, well, but that’s what I think you’re trying to say too. 00:08:22.77 [Val Kroll]: I think that’s a good connection point between some of the concepts we’re talking about and what that means to the analyst connecting it to their work. I think what you were just talking about, Michael, with the recommendations and the actions, when I think of business acumen and analysts and like building the skill, I think one of the first things is just understanding how the business makes decisions. Therefore, you can come up with the best ways to think about framing or recommendations or proposing actions for the business because it’s like, what is your relationship, you know, but everyone, you know, well-tread area between sales and marketing, but like, what is your relationship with other decision-making arms of the business and how is it supporting that, whether you’re in-house or consulting, yeah. 00:09:07.59 [Moe Kiss]: It’s funny. I actually had someone ask that in an interview and I to this day always reflect on it being such a great question. The question was how does the business make decisions? Like who are the key decision makers and like talk me through the process of like how they get signed, you know, folks get signed off for something. And I was like, it actually is such a wonderful question because it tells you so much about the culture and the ways of working. Like it really is an unlock for someone who is trying to gain that knowledge of the business quickly. 00:09:38.21 [Tim Wilson]: I think it’s there cases where I think that’s a love that point and it also is the sort of thing we’re talking about like to be a better analyst, to be thinking kind of not necessarily just who you’re direct partner that you’re supporting and I think they can wind up in a group in a, not a group thing, but kind of caught in a way of this is somebody who may be a mid-level paid media person and they have been poisoned by their media agency as to what metrics matter and they’re not necessarily don’t. thinking through the broader business, how decisions are getting made, what sales is expecting, what is coming back. There can sometimes be a challenge or an opportunity for the analysts to say, I can’t just trust exactly who I’m supporting. I mean, you want to have a positive relationship, assume good intent, but there are definitely plenty of people in business who are operating with blinders on and often the analysts are the ones, if we’re trying to connect the dots, you need to have more than one dot. So that’s kind of a weird, as you’re talking, it’s making me think about sometimes the analysts needing or having value and having a broader perspective in order to do the analysis that may be providing to somebody who has a narrower perspective to help broaden their perspective. 00:11:04.29 [Val Kroll]: No, I like that. And I think even thinking, I completely agree, because even if you think about the group that you’re supporting, it’s always helpful to think about who else might have a completely inverse motivation at that table. even if you think about resources and thinking about budget allocation or time allocation of resources or, you know, marketing wants as many leads as possible, but sales only wants to qualify leads. So there’s like this tension that I think you can tap into between these different groups to understand, you know, there was a group we were working with where we were working the leaders high up enough that we had one group in the retail group that was focused on the sell in. to the marketplace partners, and then there was a group sitting across the table from them that was only focused on sell-through. And so we had to think about how do these two concepts work together and what is the thread between them that kind of aligns to, again, how the business is making decisions. But I think that those, the motivations, even if it’s not a stated goal, helps you understand the friction and who might be not thinking the same way as the client and the group you’re supporting. 00:12:14.81 [Tim Wilson]: Okay, time for a quick break for a word from our sponsor, Ask Why. You know, we’re allergic to AI hype on this show, so when someone says, AI analyst, my first instinct is, prove it. 00:12:27.57 [Val Kroll]: It’s fair, and that’s why Ask Why caught our attention. It’s not about vibes or magic. It’s about actually automating analyst work, things like generating SQL and cleaning data and exploring data sets from plain English questions. 00:12:41.41 [Tim Wilson]: And importantly, because this matters, Asquai does not send your raw data to an LOM. They build a semantic layer on top of your data, the model writes the code, and that code runs where your data already lives. 00:12:55.29 [Val Kroll]: What’s new and genuinely interesting is that Asquai now has skills and memory. Skills let you save and reuse analytic steps you’ve already taken instead of redoing the same work over and over. 00:13:06.94 [Tim Wilson]: And the memory piece means it can retain context, business logic, assumptions, definitions, so you’re not re-explaining the same setup every single time you ask a question. 00:13:17.58 [Val Kroll]: So the promise here isn’t replacing analysts, it’s reducing the repetitive friction that slows analysts down. 00:13:24.64 [Tim Wilson]: AskY is in beta right now. Go to asky.ai, that’s ask-y.ai, and use code APH to jump to the top of their wait list. This is in Vibe Analytics. It’s tooling for the rise of the AI analyst. Now, back to the show. Can you guys think of times where you all of a sudden realized that you hadn’t fully processed how something worked in the business? And then it sort of made you say, oh, I’m seeing things with the entirely new light because somebody explained that to me. Usually mid presentation of some analysis I thought was really sharp. You’re like, you know what? This is awesome. I just got. Yeah. 00:14:11.98 [Moe Kiss]: I honestly think starting at Canva and getting an understanding of subscription revenue. Like I had worked in Ecom before. Someone bought a pair of socks. The second that item gets delivered, like we have money in the bank. It’s very different when you start thinking about annualized recurring revenue and like the fact that people are trying to extrapolate out what does this mean over a 12 month period versus like this is what has actually hit the bank. I think that was one Yeah, it takes some grappling with and then when you’ve got other revenue streams like print or something that then do hit the bank when the order gets fulfilled, so to speak. I think that’s one that even to this day, sometimes I find stakeholders don’t fully understand. I find it’s really important to be very specific about if we mean annualized revenue or annualized recurring revenue, which is a subset. There’s a lot of nuance in that and it does affect things like when you’re doing marketing, you know, you can’t just like assume, you can’t wait for every time the money lands, right? Like you have to project forward. And so like it creates a lot of complications that I probably never fully appreciated until I worked here. 00:15:24.21 [Tim Wilson]: I mean, this was like kind of blew my mind so bad. And it was actually one that the team, the business partners were making kind of a They were behaving in a way that was illustrating how badly they were looking at the data because they weren’t thinking through how the business worked. This was a company that was kind of of for and by the engineers, sold to engineers, built products for engineers, everyone in marketing, everyone was an engineer. They had engineered this solution. The R&D and engineering teams were combined, and the VP of that team had said, we’re going to start doing a monthly ROI report. And I barely knew ROI. I wasn’t even officially in an analytics role, but I was helping produce this monthly engineering ROI report. And this entire, which was a printed report that was pretty thick, that was kind of a nightmare to produce, and they went, product line by product line, and they took the total dollars invested in that month. What was paid to headcount? What were the fully loaded costs for that department? They took the revenue from that department for that month, and they did the math and said, here’s the ROI. They had been working on it, and it turned out that people were saying, The people who own those product lines were saying, well, they always had an explanation saying, well, we’re doing the R&D now. Then the thing has to go to market and then be produced. And then we’re not going to see revenue from what we’re working on now for months or years. So everything either looked fantastic or terrible, or it was a long time legacy product line that looked totally stable. And that was before I was in analytics and it was Actually, this was while I was getting my MBA and we were talking about revenue recognition is partly what triggered it. And I was like, Oh, Yeah, wait a minute. This is like the whole company is kind of whiffing, well-intentioned, but aren’t thinking through kind of the nuances of how it works. Smart enough, great products, they would kind of do the math after the fact and say, well, this product line looks terrible, but that’s because of X, Y, and Z. It’s like, but you’re looking at data that looks terrible. Shouldn’t you be looking at it in a way where it makes sense instead of distributing it? 00:17:50.88 [Moe Kiss]: So how did you solve it? Like, I guess the thing is when I hear that, I’m like, what’s been built isn’t actually trying to answer the question that was intended. So like, you gotta help me out. How’d you solve it? 00:18:06.20 [Tim Wilson]: So I was a little… Tell the end of that story. Who was like pulling the stuff. I honestly don’t… I think it kind of petered out and they’re like, this report actually doesn’t make much sense. And we need to be thinking through I think they shifted to more of a planning, like an annual plan. This is what we’re going to invest in this product line. And this is what our expectations are. And this is kind of when, so they kind of shifted, I think, to more of a forecasting model so they could forecast the costs and they could forecast the revenue and track against those instead of trying to put them together. But I was a kind of pretty low level. And I was like, this is, and I went to my manager, who was more senior, but he was kind of one of these people who’d been kind of marginalized, like pushed to the side. He’d been around the company forever. And I was like, does this make no sense whatsoever? And he was like, well, Yeah, I think it doesn’t, but we kind of know it doesn’t. It wasn’t like, oh, I’d brought some grand insight. It was kind of like, yeah, we’ve slowly been figuring out that this actually isn’t all that helpful. But there were also plenty of people who were flipping through it and saying, our product line is doing great. It’s like, well, not, I mean, incidentally. 00:19:20.93 [Val Kroll]: It’s a good story when it’s a good story until they’re on the other side of that. 00:19:25.70 [Michael Helbling]: Well, and it happens all the time. Like you mentioned a little earlier too, Tim, like some people grab onto metrics they want to optimize just because it fits within their constraints, but don’t really think further into the business of like, okay, if I optimize for this metric, what are the downstream impacts of that thing? So like, what if I go optimize for customer acquisition in a channel that isn’t really a good fit for a product and returns go way up? Well, now we’re costing the business tons of money over here. that maybe me sitting in my customer acquisition spot never sees or thinks about. Those kinds of things happen all the time. You can optimize for the wrong metric or don’t think through the flow of the money through the system to encapsulate what you’re looking for. That’s why it’s important. 00:20:16.31 [Moe Kiss]: So my mind always goes to the like annoying practical shit, but how do you develop this business acumen? Like I know I probably have ways in my mind, but I think sometimes the frustrating bit is people, like in some cases it does take time, right? Like part of knowing a business really well is the experience of working there. But there are other things that have worked for you all to develop this quickly, especially when you’re not sort of in-house and you need to develop that business acumen fast. 00:20:43.07 [Tim Wilson]: You’ve hired many people, presumably many not coming from a subscription services background. How do you ramp them up outside of the mechanics of the data? What do you have them do? 00:20:58.43 [Moe Kiss]: Why don’t you just turn it back on me? 00:21:03.04 [Michael Helbling]: Well, you had a really good example earlier. 00:21:05.43 [Moe Kiss]: What I do tend to find is part of our onboarding is normally getting to know one of the data spaces really well. So it will be something where you basically have to really dig into the data warehouse to, for example, understand how subscriptions are calculated. How is that revenue calculated? And so often, or if you’re going into the people analytics team, it might be something to do with a particular metric that needs to be calculated for that space. And by really getting your hands dirty on the subject matter, we intentionally do that as part of onboarding. But I have a very different working style than I would say to lots of data people. And the thing for me is talking to people. My advice to every new starter is spend your first month having coffees. I don’t care if you have five coffees a day. I mean, you might want to swap to herbal tea at some point, but like, have as many cat jobs with people as you need to and have a list of questions because for me, I mean, that’s how I absorb information and learn, which is really irritating for other people because it involves talking things through. That’s been my approach, but I know that’s not the case for everyone, right? 00:22:13.56 [Tim Wilson]: I mean, I feel like that’s a pretty common onboarding is giving these are the people you should meet. And I think sometimes that that’s not given because they can’t just go set up coffees because they don’t know who they’re supposed to have coffees with. So it’s on the manager or the team or whoever’s onboarding to say, these are the people and here’s why I think it falls to the analyst. I’m trying to think when I’ve started at places, in-house and I’m like, I guess I’m just going to try to meet them and I’ll come up. I didn’t frame it is I need to deeply understand how they think about the business. And it’s a great opportunity to say, I want to know how Joe thinks about the business who’s in this role. And now I want to go talk to Ann and I want to see how Ann thinks about the business. She’s in a different role. Does it match? Does it jive? By the time you get to the third or fourth one, you’re like, okay, everybody knows that so-and-so is the big dog competitor and we’re never going to beat them on price. That’s consistent. I seem to be hearing inconsistent things here, which means in the business, there’s not agreement as to the value of email marketing or whatever it is. But I think having that framing of starting a new position to say, I’m just trying to figure out, what does everyone agree is the case? Because it probably is. I mean, sure, maybe there’s some every misguided assumption that everybody’s bought into. But framing in that way of like, I want to be able to go and understand how each one of them think about the business means I’m going to learn about our business. 00:23:54.23 [Michael Helbling]: It’s like a flow discovery type of thing because you have to figure out how the money flows to the org, but you also have to figure out how people’s decisions or their work flows. through the org as well. So like to the earlier point about like how do decisions get made? Okay, yeah, what part of the PNL do you care about? What part are you motivated the most by? Because if you can understand motivations, I honestly find that like, Digging into this topic actually helps me increase my empathy for business users quite a bit because I start to understand their motivations for, okay, what are they trying to do? And then I feel like I can find ways to help them that they aren’t even able to really enunciate back to me in the first place sometimes because they don’t really know what I do. But then I can go back and say, okay, here’s three ways we can get you data that actually helps the thing I hear that you’re trying to solve for. And, you know, kind of helps like build some really nice bridges because that’s I’ve always think about it like, okay, well, what decisions are you trying to make? Or kind of like, how are you motivated, right? Like, you know, in a craft sense, like, what are you bonused on? You know, if you hit these targets, is that going to make you happy or make the business happy? And then you do find Tim, to your point, all these disconnects when you start doing that process. And you’re like, what is going on in this organization? This person is motivated and bonus this way. This person is bonus this way. Like, they’re at odds with each other. Who built this alignment? Yeah. 00:25:34.23 [Val Kroll]: And to the other part of your question, Moee, and how do you do that, especially if you’re not in-house? And I would say that there’s pros and cons, advantages, disadvantages, but because you usually start a consulting engagement like that with discovery, like Michael was just kind of talking about, you have permission to take audience with all those people and ask those questions directly. And I do find that it’s like this game of guess who, understanding like asking questions like, Oh, and where does this person sit inside the organization? And after they answer that, it’s like, okay, I don’t need to ask those four. I’m going to put those down. So they’re more in an operations function within marketing. Understood. Got it. Okay. So, and then you’re like kind of building this like understanding as you get to be like direct fire versus like trying to keep a casual over a coffee. Sometimes it’s, it’s almost beneficial to be able to say, this is the intent and purpose of this meeting. I’m going to pepper you with. 20 questions and then similar to how you would at the end of a coffee date if you’re starting to say, who else should I speak with? You have permission for that at the end of stakeholder interviews or that kind of thing. Who else should we be chatting with to fully understand what we’re trying to solve here or what the opportunity is to give it its fullest shape? 00:26:50.81 [Michael Helbling]: Yeah. Do you guys read 10Ks and company decks and stuff like that? 00:26:59.74 [Tim Wilson]: Oh, yeah. Yeah. As a consultant, definitely. And when I was in-house, I would at least would hop on the quarterly conference call when it was public and always… I never did that until I was a consultant. 00:27:13.07 [Val Kroll]: I should have, but I never thought to do it. 00:27:15.09 [Moe Kiss]: One thing that’s on my mind, though, is… As data folks, it’s always like, ask more contacts, keep asking questions, be curious. I do feel like there’s another end to the spectrum though. We had this recently with a partner. It almost got to the point where they kept asking for context and kept asking and kept asking. And it gets to a point where you’re like, you have a lot of information about our business. You know us really well. We’ve worked together. You need to stop asking for context and start coming to the table with some ideas. And I felt that was a pretty fair place to be. And we had a really great conversation. very different culture at their companies. So they were quite cautious. But I was like, it does. It gets to a point where you’re like, I understand that you’re trying to collect this information so you can present something good. But by waiting and waiting and waiting, there are ways you could check in on your thinking earlier that might get us to the outcome. Whereas if you’re always in that collection mode, sometimes I think it can also be problematic. I’m curious to hear perspectives. 00:28:30.54 [Tim Wilson]: I mean, if an analyst, consultant, in-house, whatever shows up and hasn’t even made an attempt to sort of figure it out, I think it’s always much more useful to say, with whatever knowledge I have of whatever this space and drop me in somewhere completely foreign to me, I can still say, well, I would assume that it works like X. And I think it’s, I’ve found it more useful to say, let me put forth where, how I assume it works, but let me also illustrate that I don’t know for sure. This is a logical way to think it, and that gives them the, okay, you’re trying to think, you came prepared, and that’s not sitting in a vacuum, like go and try to figure it out. Who are your competitors? I think that is actually where chatGPT can be a huge, Just going to say that. 00:29:20.16 [Val Kroll]: Yeah. 00:29:20.98 [Tim Wilson]: Go and spend some time with that, whatever you’re doing, and then say, okay, is this how this works? And then they’re reacting and saying, oh, that’s like 70% correct. But what you’re missing is this one other piece. But yeah, it would be pretty annoying. And people are like, what’s our list of stakeholder interview questions? And it’s like, well, here’s your stakeholder interview questions. But here’s the research and prep you damn well better do before you show up in that room because You are taking their time. You want to find out what they can tell you. 00:29:53.48 [Michael Helbling]: And to be honest, Moe, I think I probably struggle with the opposite problem of what you’re describing, which is I tend to have ideas of what I think the solution is before I’ve gone in depth enough to really understand the context sometimes. And so I find I have to hold myself back. from being like, oh, I think I see it, here’s the idea, here’s the solution. Instead be like, nope, gather more information, gather more information so that you don’t miss important nuance. But you’re absolutely right. There’s diminishing returns to trying to like measure four times and cut once versus iterate through like kind of what you talked about, Tim, like create an iteration, expose your assumptions and allow there to be a flow of information back and forth on top of something. And in the old saying, it’s always easier to edit than it is to create, right? So if you get something set up, then people can react to it and give you so much more valuable information as opposed to like them sort of wondering like, what the heck is this person doing in here not talking about anything? You know, so yeah. 00:30:57.46 [Val Kroll]: Yeah, the one thing that I’ll say though, if you were trying to think through, what is this striking this right balance? If you’re in an analysis validating some assumptions, some hypotheses, do you feel like the recommendations you can make to the audience you plan on delivering this to feels like something that is a lever they could pull, something that they potentially actually have control over because there’s been so many times where we’ll see examples of work where it’s like making recommendations that are so off from like what the person could actually do that it makes it feel. It almost invalidates the first 10 slides because it’s like, do you even know But what that team does or how long ago they had to make that decision, that is so unhelpful. 00:31:46.37 [Tim Wilson]: We had a business context case where we wouldn’t have known we were talking to the CEO and we said, Would there be an appetite for geolift tests? You’re not doing it. That would address this issue. And she said, absolutely not. And here’s why. And it was a damn good read. I was like, cool. And she wasn’t upset. She was like, yeah, I would love to do that. And here’s why we can’t, based on the nature of our business and we’re like, boom, ding, ding, ding, like better understanding of kind of what parameters we were operating in. So I don’t know, Michael, I feel like even if you bring and say, I’m bringing a potential solution, my assumption is this is probably not workable, but If it gives you something to react to, to tell me why it wouldn’t be workable, that’s going to help both of us. And they very well may be saying, well, that’s 30% workable and I love that. And I never thought of that. This other 70% won’t work. So. But I think Moee you’re hitting on like the balance of bringing stuff and getting stuff back. Like it does need to be a not just going and expecting to be it all being kind of a pull. It needs to be kind of a back and forth. 00:33:03.46 [Moe Kiss]: How do you bring it back though? I’ve had so many times people have walked in and presented stuff and then like, here, this is the insight and that thing you should do next. And I’m like, cool, we knew that. That’s not helpful. Or like the example you just gave Tim, that’s not feasible here for reason X. When you’re in that situation and you realize that you’ve done this, How do you course correct? How do you repair that relationship and I suppose your credibility to some degree? 00:33:34.50 [Michael Helbling]: You’re technically correct, but business wrong. 00:33:39.54 [Val Kroll]: Well, the example that Tim gave, that was in a discovery session that that happened. So that was, to Michael’s point, exploring solutions, but making sure that we weren’t going to get to the end of some piece of work, making a recommendation for a geolift test. And they’re like, get the hell out. Press the buzzer and your seat ejects you. But I’m thinking in a consulting context, if you make a recommendation that is so off base and you hit that button live, I think part of it would be unwinding some of your thinking as quickly as you can to show why you got to that conclusion, because there might be just a slightly different path forward that still relies on some of those same assumptions or some of the dots we were able to connect because, again, you went too far, but I also think that sharing some of that context and then maybe coming back with a couple questions to understand what might be a right fit. But I think it’s turning it into a discussion as quickly as possible is where my head first goes to it, because that’s the only way that you’re going to dig yourself out and be able to make a sharper recommendation next time. I don’t know. 00:34:50.70 [Tim Wilson]: Some of that goes to the stakeholder management. If that’s happening at a super high stakes, there were probably some relationship and there were some planning stuff that you whiffed on. If you’re going to go and present it, who did you vet it with beforehand in a lower stakes to make sure that the assistant or the team member say, hey, I’m going to present this? This is kind of a big deal. We’re excited to say, well, we’re going to present this amazing thing, but it may completely backfire. Better to figure out, okay, who are the people looking around whether it’s in your group or another group that you have the relationship that they seem to have their finger on the pulse of the business? that they would be a good sanity check. I think just knowing who those people are, that same company years ago, when I managed the BI team, had a lady who had been an analyst supporting sales forever. And she knew everything about how they worked. She knew the data inside and out. She knew what they cared about. She knew all the personalities. And she was kind of gold for the team. If anything was going to get presented to sales. It was like, you better run that past Shelly because she’s going to make it better and she’s going to make sure like it needs to be Shelly approved before you go put it to the business. And that was because she was just a super seasoned approachable analyst. in the team. If it went through her, it was going to be good, but it can also be somebody on who you’re presenting to. If I’m going to present to the head of sales, maybe whoever my buddy who’s in sales management, I should run it by them first to make sure that I’m not about to have the eject button hit on me when I take it to the higher stakes. 00:36:41.20 [Michael Helbling]: We’ve lost so much from in-person meetings because one of my big signals is like when the most senior person picks up their phone, you course correct instantly. Like you’re like, okay, lost you. Now I need to get you back. But even sometimes people will be like, you present all your ideas and then you don’t hear anything. And that’s almost like even worse. Like they don’t, they just write you off as, okay, that guy’s an idiot. and you don’t get any feedback, that’s brutal. And then basically you’re just trying to scrape all your way back in to those conversations after that. And it’s really, it’s just a rough thing because trust is so hard to build and being influential in a business is so hard to build. And so that’s why like kind of all your points, Tim, are super important. Like do the prep, actually run through it with somebody who can give you great feedback on it, collaborate with somebody else on like, okay, this is the analysis I’m thinking about. This is the direction I think it’s going. You know, does this ring true? What do you think this will look like in the room? I remember back in the day when I was a business analyst, when we had an important analysis to present, we would do pre-reads with all of the like most of the people who would be in the meeting just to make sure there was no big alignment issue with what we are going to present to the bigger team. Now, you can’t do that with every single analysis. There’s not time to do that. But if it’s like an important one that’s really going to drive a big decision, like, yeah, grab that director, grab that director, grab that director, make sure they don’t come in with, oh, you’re missing in a very important piece of context. that’s going to derail this whole thing before you even sit down and present this to the broader or leadership team or whoever, and that can really help you. And you just have to think through who might have impact or who might have something to say about it. 00:38:30.77 [Tim Wilson]: If having that sort of forum, and this again, I’m going back a ways, but having managing a BI team, which was where the business analysts lived, and we would do in our I think weekly, every other week, staff meeting and we would do the whole like have somebody present the analysis they were working on or had done and it would have the senior people because there was a good way for the for kind of cross-training in the junior analysts. So as you’re describing that, Michael, there’s like the, I’m Michael presenting this analysis. These are the three experts who I want to make sure I run it by. Who are the three up-and-comers or who are other lines of business who should be there who probably, probably aren’t going to weigh in, but they should learn by listening which I know sounds like Pollyanna like where are we going to find the time for people to witness this but if you’re looking through the lens of saying we need to understand the business. It was a manager that same company as the first one who said, you know, as analysts, sometimes we need to know the business better than our business partners. We need to have a broader understanding of where the moving parts are. And we’re sitting in a central function where we can have that. But that means there needs to be time expended to actually learn that broader context. 00:39:54.02 [Moe Kiss]: And it’s funny, I think one of the things we haven’t touched on though is understanding business timing, which I feel like is almost its own whole area because, and this is something that’s incredibly top of mind for me right now is about like speed to decision. And so what I do observe is, you know, the data folks going away, wanting to put their best foot forward, wanting to like work on this really, incredible, complicated pace of analysis. And it’s like, well, the business needed a decision made last week. And so now you’ve presented it and the decisions are even made. And sometimes I find coaching people through that where it’s like needing to understand the level of rigor you need and the speed, the level of confidence for the business decision being made. I find is one of the most I don’t know, underrated is probably the wrong word, but I feel like it’s something that people kind of forget a bit about and it’s one of the ones that trips up data folks very often. 00:40:55.01 [Val Kroll]: That goes back to Michael’s point about empathy, right? That’s building the empathy or building your business acumen helps build. Okay. Building your business acumen helps build your empathy for those stakeholders because you’re really in tune with the decisions that need to be made, the pressure that they’re under, the risks that they’re considering taking or being forced to take. 00:41:20.14 [Michael Helbling]: And should guide basically what kind of analysis you end up doing. Is this a massive project where we’re gonna go six months on this? Or is it sort of like quickest, dirtiest, some information to help you make a decision tomorrow? Because you’re so right, Moee. That’s one of those ones where I’ve seen this a lot where somebody rolls in with an analysis that would have been great three weeks ago and now is completely out of priority. And especially in a growing, like a fast growth company, That happens almost overnight. It’s like, oh, we moved on. We’re already onto something else, not even talking about that anymore. And you just look so out of place at that point. It’s terrible. 00:42:02.53 [Tim Wilson]: You do, but to be fair, and this is a separate challenge, and I feel like we’ve brought this up We have as the industry at large this belief in the truth and precision and magic of the data that the challenge of saying, I’m going to give you directional crude stuff, but it shows that x is greater than y. What will be heard by the business is that is the X is greater than Y in an absolute truth perspective. That’s a separate challenge. We can have marketers railing about speed to decision. What they’re thinking is I want the super precise in depth, all that detail, which probably wasn’t that hard. You just need to give me the right model or put the right AI agent on it. Uh, I need it now. And if you say, well, I can give you something now, but it’s going to be, it’s going to be pretty blunt and it may be wrong. And it’s going to be a little risky. They’ll be like, fine. So you’ll get, what you’ll get me right now will be perfect just cause I asked for it harder. So that may be a whole other episode of, you know, decision, decision science, decision skills, you know, 00:43:17.66 [Moe Kiss]: If we move really fast, are you comfortable we’re going to be wrong 30% of the time, 60% of the time? Really getting folks used to having those conversations and realizing, sure, if you need a decision tomorrow, I will give you something, but there will be assumptions and I can list them out very explicitly, but it is back at the napkin. That’s what we can do with the time we’ve got. It does require a whole different level of I don’t know, maybe maturity is the word or depth of understanding. 00:43:49.02 [Tim Wilson]: But I think it’s the other pieces that getting that understanding of at the core, what are the big boulders that we as a business are trying to push can help say, these are the things I need to always be thinking about and trying to figure out ways to bring those to bear as opposed to every request that comes in. I need to slot that into the context, the decision speed, all these other pieces. There’s another part of the deeper you get that business context, the more you can just make smarter decisions about where you’re spending your time. Which things are total throwaway? I have to spend 15 minutes on this, but it doesn’t matter. It’s never going to come up again because this was a one-time thing. with one pointless question being asked, oh, this other thing, I need to respond just as quickly in 15 minutes, but I’m also gonna keep working on it to give a more thorough answer because this, if we can crack this nut, then we really will have moved the needle. I feel like I’m talking all in abstractions and I have various examples floating through my head that I can’t figure out how to generically articulate them. 00:45:05.61 [Val Kroll]: Oh, it’s good. We’re following Tim. But the thing that this conversation, this part is making me think about is when speaking of empathy is when you’re delivering an inconvenient truth. Like when you’re saying like, oops, sorry, that painted door test like in the experimentation world says it’s not worth building out that feature or it happened a lot in like my market research days when they were doing concept tests and it’s like, ooh, sorry, everyone kind of attributed that to your competitor. It’s like not cutting through. It’s like not giving you the credibility and it’s like, shit, like what do we do? Like how do we go? And so I think like this is your other opportunity and I don’t have perfect answers here, but to be a good partner of Like what this could mean and how you can help tell the story and, you know, delivering, helping your business partners deliver the message to their higher ups. I think that’s one of the areas where you get a lot of points on the partnership realm for again, having empathy for what this means to that team’s roadmap or budget or their planning. So that’s never, never a fun moment to have to be in. 00:46:13.40 [Tim Wilson]: Sometimes it’s also a good opportunity to pull in somebody from another group. I think the number of times that the analyst gets hits with something and you’re like, I understand what you’re trying to do and you deeply want to answer this question and answer it well, and we’re not the most equipped to do that. We should go to the research team. We should go to the experimentation team. They may already have something. We understand what you’re trying to get at. I don’t know that they’re going to have a simple quick fix either, but let me loop them in, provide them the context, see what their thoughts are, see if something can happen on. on that front. I feel like that happens a lot of times with behavioral data where the question that comes in, and if you really understand what they’re thinking, you’re just trying to cram the big behavioral data answer something that is really an attitudinal data question. But you have to understand what they’re really trying to get at. 00:47:14.08 [Michael Helbling]: This is a question for the team. So we’ve been talking a lot about data analysts. Do we think everybody in the data org should be building a business acumen or there’s some roles that it doesn’t matter as much? 00:47:30.28 [Tim Wilson]: Everyone. Everyone, data engineers should be. 00:47:34.91 [Moe Kiss]: I mean, I literally, I had this conversation yesterday where a team of engineers have built out probably one of the most useful data sets that I could imagine and they left out a particular property. Because like they didn’t understand that that’s how that’s like the connecting fabric for everything we need to make that data useful and you’re like And that’s the business acumen. That’s the like here is how it’s gonna get used here. It’s here’s how it’s gonna like work with our systems here is how a Product manager is gonna answer a business question and it’s like Yeah, anyway, I’m on the very strong fence of everyone. 00:48:14.82 [Tim Wilson]: I think that’s the battle to fight against that I watch. This is like the path that the analysts will get pulled down, the data person will get pulled down as they get into the complexity of the data, which is interesting in and of itself. It is this interesting engineering challenge. There is plenty of understanding and exploration to be done and clever solutions to be come up with. And that doesn’t require going too, too far out of your comfort zone. You can just dig in and figure it out. And then they just sort of spiral down into, hey, I’m getting smarter. I’m getting a deeper understanding of the business when really I’m getting a deeper understanding of the way the data is landing in various tables, which is important and needs to be known. But it’s easy to get. I mean, I think that happens. I mean, Adobe Analytics, CJA. Google Tag Manager. There’s an infinite level of spiraling deeper and deeper into the data that can be done, and it’s got to take a conscious effort to say, you know what, for the next hour, I’m just going to go understand what the business gives a shit about instead of figuring out that how to better normalize this one metric. And that takes that takes conscious effort. 00:49:32.16 [Michael Helbling]: Yes. It’s kind of why I asked the question because I’ve run into people who kind of will be like, well, in my role, I don’t have to. And what’s always surprised me is like, I’ve never, yeah, like that or not maybe explicitly, but like no interest. And it’s so weird because I see the connection immediately from any data role you can think of. But I’ve seen data scientists do this. I’ve seen data engineers do this. Even to a certain extent, even analytics engineers or analysts who kind of live within their function. But I think it’s because you get down into the layers of complexity or arcane knowledge of the specific tools that you’re interested in. And then you sort of feel like that’s enough. The challenge would be, I don’t think you’re going to have a fulfilling of a career if you don’t spend some time trying to go up into the business itself and understand it. Going back into that, we’ve talked a little bit about how to do that. Do you think there’s benefit in going and getting an MBA if you’re a data analytics person? or under education. 00:50:45.22 [Tim Wilson]: I guess it has to be an MBA specifically. 00:50:47.35 [Moe Kiss]: I’d love to get one, but that’s more just like interest. I don’t think it’s a requirement, but I’m interested. 00:50:56.56 [Tim Wilson]: Having gotten one before I was officially in analytics and kind of stumbling backwards into it and finding it very interesting, and it was largely just because I wanted to go do something else. And every passing year, I find more like, wow, there was some good, like how did I just take one micro economics class and 23 years later, I’m still pointing back to some of the game theory that happened in that and seeing those patterns in the world. I don’t think it is a, you must, like it’s an investment of time, but there were things that I was doing Then when I was taking it that I had no idea was like getting is embedded in my brain. And I think did give me deeper understandings of different aspects of the business. So I’m a fan, but I’m also not a reliable assessor. Um, you guys, and I’ll take the FedEx commercial and say, so easy an MBA can do it, you know. 00:51:59.08 [Val Kroll]: Well, as someone who doesn’t have their MBA, I’m similar to Moee. It’s something that’s always interest me, but my very small-scale proxy for ways that you can get deeper in some of that outside of some of these conversations and two different roles that I’ve had In the past, similar to how you go through these exercises to get closer to what the experience is in your customer shoes, I’ve had sitting in rotation with some people. Some of my business partners are stakeholders. When I was at UBS within the investment bank, I spent a couple of days with ride-alongs with some of the research analysts themselves from the top of the morning to the end of the day. My mind was blown within the first five minutes because the analyst that I was following said, oh, I can’t take the subway into work. And I was like, what do you mean you can’t take the subway? We live to New York City. I’m like, what do you mean you can’t take the subway? And he’s like, I literally can’t afford to not be reachable during these hours. And so I have to be able to hop on a call because that’s how I service my my customers and I was like, that is crazy. But I just felt like I, speaking back again, the theme of empathy here understood so much deeper, like what was at stake for him or others in that role and how data, I’m thinking like, well, what do you mean you didn’t read the thing that I sent you and he can’t even get on the subway, right? Not really going back to answer your MBA question, Michael, but just talking about like, how do you find like really deep ways to extract some of that? And that’s, that was the thing that, that cropped up in my, my head like rotations. 00:53:39.62 [Tim Wilson]: I feel like I should also throw in that there are all the very executive ed stuff, and some of those are just ways for schools to just print money. It’s really hard to know what’s garbage and what’s not, but my wife went through one of those mini-MBA type thing, Harvard’s Core Program, capital C-O-R, lowercase e. courses in semesters, but it was six months or something. It was totally doable. She’s in a PMO type roles. She’s like, this has been really useful because the people that I’m working with are sometimes talking about useful to get just a surface level accounting background. surface level finance background, surface level marketing. And that was a much, much lower lift. And even as she was doing, she’s like, oh, this is like really useful. And then there was other stuff that she was like, I could give two shits about this. I don’t think I’m ever going to need it. But so I think there are those in that, but also it was the learning style. If somebody is a, if you are, I need the structure of some sort of a program, there are scads of them out there. 00:54:57.84 [Michael Helbling]: Yeah, I think I was more negative towards MBAs earlier and now I’m more ambivalent. I’m personally not gonna probably pursue one at any point in time, but I could see where they’d be useful. So I’m more open to them now. Probably because I know you, Tim, that’s helped me learn to love MBAs. He’s not so bad. Yeah, exactly. All right, we’ve got to start to wrap up. So hopefully this has been a good discussion about business acumen and you feel like you’ve got a couple of directions. I think now that AI is so prevalent, I feel like any business question you could think of, you could get a really decent answer, at least at a base level from an AI. So those kinds of tools are things like, You don’t have to go buy a whole book on the innovator’s dilemma, although you should read that. But you could also just get a rundown on a topic pretty easily with AI these days. All right. Before we jump into last calls, I want to take a quick break and have a chat with our friend, Michael Kaminsky, from ReCast. There’s a media mix modeling and geolift platform helping teams forecast accurately and make better decisions. You’ve heard Michael sharing a lot of bite-sized marketing science lessons over the past few months and they hopefully are helping you measure smarter. Well, let’s get over to you one more time, Michael. 00:56:17.88 [Michael Kaminsky (Recast)]: Before running any analysis, we need to ask, do we have the right data and model to answer the question we care about? Often we don’t. The problem is really common in economic analyses where you want to estimate a demand curve from your data. But if you only have data on price and quantity sold, you can’t actually determine how much is driven by supply changes versus demand changes. The model can’t be identified statistically with just sales data. You would need data on some other external factor that only affects supply or only affects demand in order to be able to identify the effects you care about. Identification issues can stem from data limitations or model structure problems, and in very complex models, these issues can hide in the structure of the model really easily. Even in simpler models, multicollinearity or correlated variables can make models practically unidentifiable due to insufficient data variation to estimate parameters. My favorite way to check for identifiability issues in a model is via simulation and parameter recovery exercise. we can simulate data where we know what the values of the parameters of interest are, since we use them to simulate the data, and then we can check if our model can accurately estimate those parameters from the data. If it can do that consistently, we don’t have identification issues, but if the model fails to recover, then we know we have a problem. So the takeaways are, be thoughtful about your ability to learn the parameters of interest from your model, and use simulation exercises to check for identifiability problems in your analysis. 00:57:38.46 [Michael Helbling]: All right, thanks, Michael. And for those of you who haven’t heard, our friends at ReCast just launched their new incrementality testing platform, GeoLift by ReCast. It’s a simple, powerful way for marketing and data teams to measure the true impact of their advertising spend. And even better, you can use it completely free for six months. Just visit www.getrecast.com slash geolift to start your trial today. All right, let’s do some last calls really briefly. Moe, let’s start with you. What’s your last call? 00:58:13.36 [Moe Kiss]: Okay. So about a month ago, there was a really horrific incident that happened in Bondi in Australia. And it’s been a really shitty time in both our city and our country. But I’ve been really grateful because it just happened that I started reading this book a few days before. which is called humankind, a hopeful history. I can’t say it’s first name, so the author is Breakman. But his main premise is that human nature is fundamentally good. And I won’t give away the whole book, but what I will say is he, one of my favorite examples is he talks about Lord of the Flies. So if you’re not familiar, a bunch of kids, deserted island, they all end up blowing up at each other. And he found a real life Lord of the Fly situation, which I can’t remember if it was five or six kids in the Pacific and how they actually cooperated and came together, never let the fire go out and ultimately ended up getting saved. And I just It just happened to randomly be a book that I read at the right time. So if you’re feeling a little bit pessimistic at the moment, it’s definitely one that I recommend just to remind you of the good in people. 00:59:37.46 [Michael Helbling]: Yeah, that’s a good reminder. Thank you, Moe. All right, Tim, what about you? What’s your last call? 00:59:43.11 [Tim Wilson]: There was a podcast about the real life guys and I can’t find it. 00:59:48.09 [Moe Kiss]: Oh, I’m dying to hear it. 00:59:49.28 [Tim Wilson]: It tells their story and they actually went back and talked to a couple of them because the guy, the kids had like stolen a boat or something and then they got. They stole a boat. Yeah, they stole a boat. But they wouldn’t actually talk to one or the two of the people who were still around. So I’ll track it down and throw it in the show notes as well. So mine would be just super entertaining. I realized that if Ben Stansel is on stage describing a ham sandwich, I will pay money to go see it. He did a talk. at the Small Data San Francisco 2025, 17 minutes long. The title is, in the long run, everything is a fad. It is like, it zips along, it’s grounded in kind of the Jordan Childs Olympics, third bronze or not. How long was she challenged? Gymnastics thing, but it is so good. And his point actually, Moee gets to kind of that decision making. He kind of makes the case that Maybe AI and LLMs being good at sort of picking up the vibes from stuff, that that may be a more effective thing for people to make decision is just decisions quickly getting a sense of the vibes, even if it’s not hard and quantitative data. He has a whole thing about kind of different generations and what they think is kind of the core of making decisions. But it is like 17 minutes that just blows along and it’s He is just one of the most engaging presenters ever, and I can’t recommend it highly enough. 01:01:27.22 [Michael Helbling]: Nice. Thank you. All right, Val, what about you? What’s your last call? 01:01:33.59 [Val Kroll]: It’s a twofer, but I’ll be quick. So part one is, Michael, you took a break from the APH, Mike, to join another podcast recently. We’re not too jealous. But it was a new podcast, Knowledge Distillation from the Ask Why team. And Michael appears on episode four, which is about trust and bottlenecks and the difference between data retrieval and actual analysis. And Michael, we loved it. And so wanted to give you a shout as one of my two last calls here. 01:02:12.29 [Tim Wilson]: Why don’t you bring that kind of quality to this this podcast? 01:02:16.06 [Michael Helbling]: I don’t know, Tim. Maybe there’s someone always talking over everybody. 01:02:20.01 [Tim Wilson]: Damn it, Moe. I’ll talk to her about it. 01:02:26.85 [Val Kroll]: We’ll take that offline. And then the second one is for an upcoming conference. DataTune is in Nashville. Two-day conference March 6th and 7th. Tickets are on sale. But it’s all about data, analytics, AI, some of the things you’d expect to see. And Tim and I will actually both be there. So we’re speakers at that, and we’re looking forward to it. So if you’re looking for something in March, we’ll see in Nashville. 01:02:56.60 [Tim Wilson]: Nashville. 01:02:58.55 [Val Kroll]: How about you, Michael? What’s your last call? 01:03:00.28 [Tim Wilson]: What should we actually say? Is there any other conference that we’re going to be at? I’m trying to think. 01:03:04.91 [Michael Helbling]: Well, I believe we will be at the Marketing Analytics Summit in April. The Analytics Power Hour will be there. And I believe that’s April 28th and 29th, if memory serves. And we’re excited because it is actually the 25th anniversary of that particular conference. It went by a different name when it’s early days, but now it’s called the Marketing Analytics Summit. And so we’re pretty excited to celebrate with the industry. Go get tickets, come. It’s going to be a blast. There’s some amazing speakers already lined up. And this little crew will be regaling you with our chit chat and something. We’ll come up with a topic. All right, my last call, let’s just come back to sort of the business acumen thing because I got all my business acumen the hard way. I like finding resources or places where I can learn things or I consistently find good information about this kind of stuff. And one of those places is common cog.com, which is run by Cedric Chin, who has been a guest on the show before. They evaluate cases, they write a big long form articles. So there’s a lot of explanation. There’s a community. So there’s a lot of discussion. You can talk to other business people. So I really enjoy that website, common cog.com. So if you’re in a role where you’re trying to ramp up on your business acumen, that might be a great resource to potentially leverage as well. All right. Well, this has been fun. I think this is something we come back around on semi-regularly, but I think it still maintains its importance in the life of anyone working in data and analytics. So thank you, everybody, for putting your time and effort and thoughts into this episode. All of you, thank you. 01:04:55.86 [Tim Wilson]: Thanks for having us, Michael. 01:04:57.36 [Val Kroll]: Yes. 01:04:58.42 [Michael Helbling]: Fun as always. You don’t have to say anything. I’ll take it from here. No. Too much dead air. Couldn’t take it. Couldn’t take it. That’s right. Let’s talk a little bit about how you can reach out to us. We’d love to hear from you. And the best way to do that is on our LinkedIn page or on the Measure Slack chat group or You can also email us at contact at analyticshour.io and you know what, we also take a look and see what ratings and reviews people leave for us on the various platforms. So if you leave us a review, we’re excited to see that also. I’d love to hear those also. All right. Go get better at understanding the business. It’s going to help your career. It’s going to make you more influential. It’s going to make you more impactful. And I think I can speak for all of my co-hosts when I say, no matter what your level or years of experience, keep analyzing. 01:05:57.53 [Announcer]: Thanks for listening. Let’s keep the conversation going with your comments, suggestions, and questions on Twitter at @analyticshour on the web at analyticshour.io, our LinkedIn group, and the Measure Chat Slack group. Music for the podcast by Josh Crowhurst. So smart guys wanted to fit in. So they made up a term called analytics. Analytics don’t work. 01:06:22.10 [Charles Barkley]: Do the analytics say go for it, no matter who’s going for it? So if you and I were on the field, the analytics say go for it. It’s the stupidest, laziest, lamest thing I’ve ever heard for reasoning in competition. 01:06:35.36 [Michael Helbling]: The most accurate business acumen. It’s interesting, Tim, I forgot that you had an MBA. 01:06:43.63 [Moe Kiss]: Like, Tim had a whole book on it. 01:06:47.59 [Michael Helbling]: Is that what that book is about? His MBA? at some point this afternoon coffee is gonna kick in and I’ll be ready to start the show. Moe is literally recording this in a rain forest right now. 01:07:06.91 [Moe Kiss]: I mean there are fewer places I’ve recorded like under the kitchen bench in that place in Italy. 01:07:13.78 [Tim Wilson]: There are so many trees and some of them are even organic. There’s the coat tree. 01:07:17.70 [Michael Helbling]: You got the, yeah, decision tree. All right. That would actually be a cool gift. 01:07:24.99 [Moe Kiss]: Random forests, you know. 01:07:26.95 [Tim Wilson]: Random forests, exactly. Giving everyone a decision tree. That’s right. It’s my, fits in the envelope better. Jump. 01:07:37.05 [Val Kroll]: You can use it at least a little bit. I knew you were gonna say that, Michael. 01:07:43.70 [Michael Helbling]: We belong in the same generation. That’s right. It includes what? Jump to conclusions, Matt? 01:07:54.71 [Val Kroll]: Office space? We were joking about office space yesterday, Tim. 01:07:57.75 [Michael Helbling]: Yeah, come on. 01:07:58.81 [Val Kroll]: When Tim was working on postal codes, cleanliness, whatever project he was at nationwide, I just imagined he was Milton in the basement. 01:08:10.98 [Michael Helbling]: And it was one where like in my memory, I was told I could use Excel at a reasonable volume. 01:08:22.96 [Tim Wilson]: So good. Well, it’s interesting because of the lag and you being in the southern hemisphere, we’re actually hearing what you say before you think it. It’s kind of interesting. 01:08:33.91 [Michael Helbling]: No. Which one do you think will… Moee, just try whatever you think will work best. I don’t… We don’t care. 01:08:42.77 [Moe Kiss]: The reason I use this room is because it has no air con, so no whirring sounds. And it has hypothetically some sound things up. If I go to a meeting room downstairs, the Wi-Fi could be better, but my internet could be really shitty. 01:09:00.12 [Val Kroll]: How many trees will be there in that room? 01:09:06.67 [Michael Helbling]: All right, we’ll think of cool tree jokes while you get reset up. Oh, you guys are going to the DataTube conference. Okay, good. I’m glad some of us are going because I completely whiffed on submitting anything to that guy when he reached out to us about it. And then I remembered it like a month later and I was like, oh, crap, I missed the deadline for that completely. 01:09:44.37 [Tim Wilson]: I’m glad the top has some decorum. Wait, it’s a day-long workshop? 01:09:54.36 [Michael Helbling]: You both are doing a whole day workshop? Or maybe it’s a half day. 01:09:58.43 [Val Kroll]: First time hearing about it. 01:10:00.73 [Michael Helbling]: Oh my gosh. 01:10:09.85 [Tim Wilson]: Rock flag and concepts and context. The post #289: The Imperative of Developing Business Acumen appeared first on The Analytics Power Hour: Data and Analytics Podcast .",
      "published_ts": 1768883703,
      "source_name": "Analytics Power Hour",
      "content_type": "rex"
    },
    {
      "url": "https://huggingface.co/blog/microsoft/diff-attn-v2",
      "title": "Differential Transformer V2",
      "summary": "Differential Transformer V2\nTianzhu Ye, Li Dong, Yutao Sun, Furu Wei\nGithub Link\nNotion Link (for better readability)\nAbstract\nWe introduce\nDifferential Transformer V2\n(DIFF V2), an improved version of\nDifferential Transformer\n(DIFF V1). This revision focuses on inference efficiency, training stabil",
      "published_ts": 1768879257,
      "source_name": "Hugging Face Blog",
      "content_type": "technical"
    },
    {
      "url": "https://about.gitlab.com/blog/gitlab-bug-bounty-program-policy-updates/",
      "title": "GitLab Bug Bounty Program policy updates",
      "summary": "GitLab first introduced our HackerOne Bug Bounty program in 2018. Since then, we’ve worked with the researcher community to help secure our comprehensive AI-powered DevSecOps platform. We're excited to announce policy updates to the program that reflect our commitment to transparency, feedback from researchers, and our ongoing efforts to provide clear expectations and streamlined processes. What's changing Here is what you need to know: Enhanced testing guidance We're placing stronger emphasis on local testing environments to protect both researchers and our production infrastructure. We're strongly recommending local GitLab Development Kit (GDK) testing for most security research. The GDK gives you access to cutting-edge features before public release and the freedom to experiment without production infrastructure concerns. If you need to demonstrate denial-of-service (DoS) impact, we recommend testing on a self-managed GitLab instance with specifications and resources equal to or greater than the self-managed GitLab installation requirements . For vulnerabilities requiring GitLab.com production architecture, you must use test accounts created with your HackerOne email alias: yourhandle@wearehackerone.com . Refined scope for better focus We've clarified several scope areas based on community feedback: DoS is out of scope: Exceptions may be considered for application layer DoS vulnerabilities that achieve persistent total service disruption AND can be executed through unauthenticated endpoints. Some examples include ReDoS, logic bombs, etc. Prompt injection: Standalone prompt injection is out of scope, but prompt injection may be eligible if it serves as an initial vector to achieve harm beyond its security boundary. Metadata and enumeration : General information gathering remains out of scope while privacy breaches exposing confidential data are in scope. We've provided new, detailed examples distinguishing between these two types of issues on the program policy page . Transition period for researchers We recognize that policy changes can create uncertainty for researchers with active investigations. To maintain trust during this transition and avoid disrupting valuable research already under way: GitLab is offering a 7-day grace period for DoS reports submitted before 2026-01-22, 9:00 p.m. Pacific Time (2026-01-23T00:05:00Z). Reports submitted before then will be evaluated under our previous policy. Your investment in GitLab's security matters to us, and we're committed to honoring the policy under which you began your research. Our commitment to the community These changes reflect our deep commitment to the researcher community through three key principles. 1. We're prioritizing transparency by establishing clearer boundaries and objective criteria that reduce ambiguity and prevent disputes. 2. We're enhancing safety through improved testing platform guidance that protects both production systems and researchers from accidental service disruption. 3. We're ensuring fairness through consistent evaluation standards and provisions that guarantee equitable treatment for all researchers, including those already in the program. Scope refinements also support program sustainability by focusing resources on high-impact security issues while maintaining broad coverage. Get started Ready to contribute to GitLab's security? New researchers: Visit our HackerOne program page . Set up local testing: Download the GitLab Development Kit . Review full policy: Check our complete documentation for detailed guidelines . Understand severity assessment: Explore our CVSS calculator . We're grateful for the security research community's ongoing partnership in keeping GitLab secure. Your expertise and dedication make a real difference for millions of users worldwide. Questions about these changes? Reach out to our team by creating an issue in our HackerOne questions project on GitLab.",
      "published_ts": 1768867200,
      "source_name": "GitLab Engineering",
      "content_type": "technical"
    },
    {
      "url": "https://www.snowflake.com/content/snowflake-site/global/en/blog/ai-shopping-retail-roadmap",
      "title": "AI in Shopping: A Value-Creating Roadmap for Retailers",
      "summary": "Explore how AI-powered shopping is changing retail, and the practical roadmap retailers can follow to compete and win amid disruption",
      "published_ts": 1768842000,
      "source_name": "Snowflake Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.blog.langchain.com/customers-remote/",
      "title": "How Remote uses LangChain and LangGraph to onboard thousands of customers with AI",
      "summary": "Guest post written by José Mussa (Staff Software Engineer @ Remote) Remote is a fast-growing startup helping companies hire, manage, and pay employees globally from a single platform. Remote’s customers operate across many countries and regulatory environments, and they trust Remote as the system of record for their",
      "published_ts": 1768838407,
      "source_name": "LangChain Blog",
      "content_type": "technical"
    },
    {
      "url": "https://blog.cloudflare.com/acme-path-vulnerability/",
      "title": "How we mitigated a vulnerability in Cloudflare’s ACME validation logic",
      "summary": "A vulnerability was recently identified in Cloudflare’s automation of certificate validation. Here we explain the vulnerability and outline the steps we’ve taken to mitigate it.",
      "published_ts": 1768831200,
      "source_name": "Cloudflare Engineering",
      "content_type": "technical"
    }
  ],
  "cloud_infra_observability": [
    {
      "url": "https://aws.amazon.com/blogs/big-data/managing-amazon-opensearch-ui-infrastructure-as-code-with-aws-cdk/",
      "title": "Managing Amazon OpenSearch UI infrastructure as code with AWS CDK",
      "summary": "As organizations scale their observability and analytics capabilities across multiple AWS Regions and environments, maintaining consistent dashboards becomes increasingly complex. Teams often spend hours manually recreating dashboards, creating workspaces, linking data sources, and validating configurations across deployments—a repetitive and error-prone process that slows down operational visibility. The next generation OpenSearch UI in Amazon OpenSearch Service […]",
      "published_ts": 1769125366,
      "source_name": "Redshift / AWS Big Data",
      "content_type": "technical"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/announcing-amazon-ec2-g7e-instances-accelerated-by-nvidia-rtx-pro-6000-blackwell-server-edition-gpus/",
      "title": "Announcing Amazon EC2 G7e instances accelerated by NVIDIA RTX PRO 6000 Blackwell Server Edition GPUs",
      "summary": "AWS introduces Amazon EC2 G7e instances accelerated by the NVIDIA RTX PRO 6000 Blackwell Server Edition GPUs with up to 2.3 times inference performance. G7e instances deliver cost-effective performance for generative AI inference workloads and the highest performance for graphics workloads.",
      "published_ts": 1768944176,
      "source_name": "AWS Blog",
      "content_type": "technical"
    },
    {
      "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-kiro-cli-latest-features-aws-european-sovereign-cloud-ec2-x8i-instances-and-more-january-19-2026/",
      "title": "AWS Weekly Roundup: Kiro CLI latest features, AWS European Sovereign Cloud, EC2 X8i instances, and more (January 19, 2026)",
      "summary": "At the end of 2025 I was happy to take a long break to enjoy the incredible summers that the southern hemisphere provides. I’m back and writing my first post in 2026 which also happens to be my last post for the AWS News Blog (more on this later). The AWS community is starting the […]",
      "published_ts": 1768868678,
      "source_name": "AWS Blog",
      "content_type": "technical"
    }
  ],
  "data_modeling_governance": [
    {
      "url": "https://roundup.getdbt.com/p/apache-iceberg-and-the-catalog-layer",
      "title": "Apache Iceberg and the catalog layer (w/ Russell Spitzer)",
      "summary": "Everything you ever wanted to know about open table formats with a member of Apache Iceberg and Apache Polaris",
      "published_ts": 1769349567,
      "source_name": "The Analytics Engineering Podcast (dbt)",
      "content_type": "technical"
    },
    {
      "url": "https://www.youtube.com/watch?v=iyWOy8RliiM",
      "title": "OneLake Explained in less than 10 Minutes (Microsoft Fabric Fundamentals)",
      "summary": "What if you could stop copying, duplicating, and moving data just to make analytics work?\n\nThat’s exactly the problem OneLake was built to solve.\n\nIn this video, Marthe break down what OneLake really is, why it’s the foundation of Microsoft Fabric, and how it helps you manage all your data in one unified data lake without duplication.\n\nWhether you’re brand new to Fabric or looking to close knowledge gaps, this video walks through the core OneLake concepts you actually need to understand.\n\n🚀 What You’ll Learn in This Video\n- What OneLake is and why Microsoft built it\n- How OneLake works across all Fabric workloads\n- Using OneLake Explorer like OneDrive for data (Link mentioned in video: https://learn.microsoft.com/en-us/fabric/onelake/onelake-file-explorer )\n- How Shortcuts eliminate duplicated data\n- Understanding access control & security levels\n- Governing data with OneLake Catalog & Events\n- How storage and cost work in OneLake\n\n⏱️ Chapters\n\n00:00 – The data duplication problem\n00:36 – What is OneLake?\n01:06 – OneLake Explorer\n02:57 – Shortcuts explained\n04:08 – Access control & security\n06:15 – OneLake Catalog & governance\n08:28 – OneLake Events\n09:03 – Cost & storage model\n\n📢 Become a member: https://guyinacu.be/membership \n\n*******************\n\nWant to take your Power BI skills to the next level? We have training courses available to help you with your journey.\n\n🎓 Guy in a Cube courses: https://courses.guyinacube.com/\n\n*******************\nLET'S CONNECT!\n*******************\n\n-- https://bsky.app/profile/guyinacube.bsky.social\n-- http://twitter.com/guyinacube\n-- http://www.facebook.com/guyinacube\n\n\n#PowerBI #GuyInACube",
      "published_ts": 1769009427,
      "source_name": "Guy in a Cube (YouTube)",
      "content_type": "technical"
    },
    {
      "url": "https://www.databricks.com/blog/practical-ai-governance-framework-enterprises",
      "title": "A Practical AI Governance Framework for Enterprises",
      "summary": "As organizations embrace AI at scale, the need for formal governance grows. Enterprises...",
      "published_ts": 1768952700,
      "source_name": "Databricks Blog",
      "content_type": "technical"
    }
  ],
  "etl_orchestration": [
    {
      "url": "https://www.rudderstack.com/blog/build-pqls-that-convert",
      "title": "From product usage to sales pipeline: Building PQLs that actually convert",
      "summary": "Turn product usage into PQLs that convert with real-time alerts plus warehouse scoring, then sync to Salesforce or HubSpot with reverse ETL.",
      "published_ts": 1769111676,
      "source_name": "Rudderstack Blog",
      "content_type": "technical"
    },
    {
      "url": "https://dagster.io/blog/dagster-snowflake-cortex",
      "title": "Dagster + Snowflake: Building Production AI Pipelines with Cortex",
      "summary": "Learn how to orchestrate Snowflake Cortex AI functions with Dagster for production-ready pipelines, including incremental processing, cost tracking, and dbt integration.",
      "published_ts": 1769093737,
      "source_name": "Dagster Blog",
      "content_type": "technical"
    },
    {
      "url": "https://airbyte.com/blog/airbyte-agent-engine-in-private-preview",
      "title": "Airbyte Agent Engine: Now in Private Preview | Airbyte",
      "summary": "The Airbyte Agent Engine builds on these to give your agents a unified interface to external data sources. Our platform includes a fully-managed authentication module supporting OAuth, hosted agent connectors, and the Entity Cache.",
      "published_ts": 1769040000,
      "source_name": "Airbyte Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.getdbt.com/blog/sweetgreen-conversational-analytics-dbt-ai",
      "title": "How Sweetgreen transformed unstructured data into conversational analytics with dbt and AI",
      "summary": "Sweetgreen built trustworthy conversational analytics by standardizing data and metrics with dbt and AI.",
      "published_ts": 1769032380,
      "source_name": "dbt Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.getdbt.com/blog/cribl-dbt-omni-ai-analytics",
      "title": "Closing the context gap: Cribl’s blueprint for trusted AI with dbt + Omni",
      "summary": "AI analytics fail without context. See how Cribl solved this to deliver trusted, AI-powered insights to 700+ users.",
      "published_ts": 1769023320,
      "source_name": "dbt Blog",
      "content_type": "technical"
    },
    {
      "url": "https://airbyte.com/blog/airbyte-joins-agentic-ai-foundation",
      "title": "Airbyte Joins the Agentic AI Foundation | Airbyte",
      "summary": "Airbyte joins the Agentic AI Foundation under the Linux Foundation to support open, interoperable agentic AI infrastructure and standards.",
      "published_ts": 1768867200,
      "source_name": "Airbyte Blog",
      "content_type": "technical"
    }
  ],
  "hors_sujet": [],
  "lake_storage_formats": [
    {
      "url": "https://aws.amazon.com/blogs/big-data/on-demand-and-scheduled-scaling-of-amazon-msk-express-based-clusters/",
      "title": "On-demand and scheduled scaling of Amazon MSK Express based clusters",
      "summary": "Amazon MSK Express brokers are a key component to dynamically scaling clusters to meet demand. Express based clusters deliver 3 times higher throughput, 20 times faster scaling capabilities, and 90% faster broker recovery compared to Amazon MSK Provisioned clusters. In addition, Express brokers support intelligent rebalancing for 180 times faster operation performance, so partitions are automatically and consistently well distributed across brokers. Intelligent rebalancing automatically tracks cluster health and triggers partition redistribution when resource imbalances are detected, maintaining performance across brokers. This post demonstrates how to use the intelligent rebalancing feature and build a custom solution that scales Express based clusters horizontally (adding and removing brokers) dynamically based on Amazon CloudWatch metrics and predefined schedules. The solution provides capacity management while maintaining cluster performance and minimizing overhead.",
      "published_ts": 1769102834,
      "source_name": "Redshift / AWS Big Data",
      "content_type": "technical"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/enterprise-scale-in-place-migration-to-apache-iceberg-implementation-guide/",
      "title": "Enterprise scale in-place migration to Apache Iceberg: Implementation guide",
      "summary": "Organizations managing large-scale analytical workloads increasingly face challenges with traditional Apache Parquet-based data lakes with Hive-style partitioning, including slow queries, complex file management, and limited consistency guarantees. Apache Iceberg addresses these pain points by providing ACID transactions, seamless schema evolution, and point-in-time data recovery capabilities that transform how enterprises handle their data infrastructure. In this post, we demonstrate how you can achieve migration at scale from existing Parquet tables to Apache Iceberg tables. Using Amazon DynamoDB as a central orchestration mechanism, we show how you can implement in-place migrations that are highly configurable, repeatable, and fault-tolerant.",
      "published_ts": 1768940641,
      "source_name": "Redshift / AWS Big Data",
      "content_type": "technical"
    }
  ],
  "news": [
    {
      "url": "https://www.youtube.com/watch?v=dB6uDsUK4mg",
      "title": "Live on Site: Inside the AWS European Sovereign Cloud Launch",
      "summary": "Last week I attended the exclusive AWS European Sovereign Cloud launch event in Potsdam, Germany — with press, analysts, AWS partners, and policymakers all in one room.\n\nIn this recap, I’m taking you behind the scenes: from the first conversations with @amazonwebservices  leaders to deep dives into cloud sovereignty, security, and governance. Plus: a look at the new sovereign data center.\n\nYou’ll also find my full interviews on the channel with:\n✅ Stéphane Israël (Managing Director): https://youtu.be/pH0X1Excdkg\n✅ Colm MacCarthaigh (VP & Distinguished Engineer): https://youtu.be/1xgyd3v4EWs\n✅ Mustafa Isik (Chief Technologist): https://youtu.be/Skmm2K8ZxEA\n\nAnd yes, I even got to sit in the press conference with AWS CEO Matt Garman. 👀\n\n#ad #awspartner",
      "published_ts": 1769353266,
      "source_name": "Andreas Kretz (YouTube)",
      "content_type": "technical"
    },
    {
      "url": "https://www.youtube.com/watch?v=Skmm2K8ZxEA",
      "title": "How AWS Designs for Cloud Sovereignty",
      "summary": "AWS European Sovereign Cloud is officially launched. But what does that actually mean for customers?\n\nIn this clip, I talk with Mustafa Isik, Chief Technologist of the AWS European Sovereignty Cloud, about what customers are really asking for when it comes to digital sovereignty and how @amazonwebservices is responding.\n\nWe cover:\n✅ What “sovereignty by design” means in AWS\n✅ Why data residency alone isn’t the full story anymore\n✅ The 3 pillars behind the European Sovereign Cloud (governance, operations, infrastructure)\n✅ What’s different vs. “regular” AWS regions\n✅ The first region in Brandenburg, Germany + upcoming local zones across Europe\n\n#ad #awspartner",
      "published_ts": 1769191236,
      "source_name": "Andreas Kretz (YouTube)",
      "content_type": "technical"
    },
    {
      "url": "https://www.youtube.com/watch?v=pH0X1Excdkg",
      "title": "AWS Just Changed Cloud Computing in Europe | European Sovereign Cloud Launch",
      "summary": "Customers want the best of both worlds: sensitive data protection and full cloud capabilities.\n\nIn this interview, Stéphane Israël, Managing Director of the @amazonwebservices European Sovereign Cloud, explains how it’s built to deliver exactly that without compromising on services like AI.\n\nWe talk about:\n✅ What’s different vs. standard regions\n✅ The new Brandenburg region + upcoming European local zones\n✅ Independent validation + audits\n✅ Governance, operations, and cloud autonomy built specifically for Europe\n\n#ad #awspartner",
      "published_ts": 1769187682,
      "source_name": "Andreas Kretz (YouTube)",
      "content_type": "technical"
    },
    {
      "url": "https://www.youtube.com/watch?v=htAipJ6yYFs",
      "title": "Common Data Pipeline Patterns You’ll See in the Real World - Types Of Data Pipelines You'll Build",
      "summary": "Whether you’re working at a large enterprise or a small business, there has likely been some need to take data out of the various source systems, process it, and then use it for either operational or analytical purposes.\n\nAdd in a few lines of code or a low-code solution, and the term data pipeline might start getting thrown around.\n\nThis might make some data engineers angry, but if you think about it, someone extracting data from a data source into Excel, adding in VLOOKUPs, some data cleansing via formulas and IFELSE() statements is essentially building a data pipeline….\n\nOk, it’s not the exact same thing, but when you stop and think about it, it can functionally solve a similar problem(although often in a more limited and specific way)\n\nMy point is that there are a lot of different ways and reasons people build data pipelines.\n\nSo, to kick off 2026, I wanted to discuss some of the key reasons data pipelines exist and the types of pipelines you will run into.\n\nA few months back, I wrote an article about what hasn’t changed in the data world. And much of what hasn’t changed are the problems we face.\n\nOf course, there are also plenty of things that have changed in the data world since I started. For example, the technologies and practices we use.\n\nEven the words and terms we use, although mostly the same, have changed. Whether you like it or not.\n\nWhen I started, no one used the term analytics engineer, and even the concept of a data engineer was still relatively new(at least in terms of how popular it later became).\n\nIn the same way, I have seen plenty of things change. Some of these changes are temporary, I believe (like my first point), others are likely larger trends.\n\nSo let’s dive into what’s changed in the data world in the last decade.\n\nIf you enjoyed this video, check out some of my other top videos.\n\nIntro To Databricks - What Is Databricks\nhttps://www.youtube.com/watch?v=QNdiGZFaUFs\n\nThe Inconvenient Truths of Self-Service Analytics - Tell Me Lies Tell Me Sweet Little Lies\nhttps://www.youtube.com/watch?v=vIclW1EqeUg\n\nIf you're looking for help ingesting your data in batch or real time, then you need to check out Estuary - https://bit.ly/4eQC3oQ\n\nIf you'd like to read up on my updates about the data field, then you can sign up for our newsletter here.\n\nhttps://seattledataguy.substack.com/​​\n\nOr check out my blog\nhttps://www.theseattledataguy.com/\n\nAnd if you want to support the channel, then you can become a paid member of my newsletter\nhttps://seattledataguy.substack.com/subscribe\n\n\nTags: Data engineering projects, Data engineer project ideas, data project sources, data analytics project sources, data project portfolio\n\n_____________________________________________________________\nSubscribe: https://www.youtube.com/channel/UCmLGJ3VYBcfRaWbP6JLJcpA?sub_confirmation=1\n_____________________________________________________________\nAbout me:\nI  have spent my career focused on all forms of data. I have focused on developing algorithms to detect fraud, reduce patient readmission and redesign insurance provider policy to help reduce the overall cost of healthcare. I have also helped develop analytics for marketing and IT operations in order to optimize limited resources such as employees and budget. I privately consult on data science and engineering problems both solo as well as with a company called Acheron Analytics. I have experience both working hands-on with technical problems as well as helping leadership teams develop strategies to maximize their data.\n\n*I do participate in affiliate programs, if a link has an \"*\" by it, then I may receive a small portion of the proceeds at no extra cost to you.",
      "published_ts": 1769187316,
      "source_name": "Seattle Data Guy (YouTube)",
      "content_type": "technical"
    },
    {
      "url": "https://blog.cloudflare.com/route-leak-incident-january-22-2026/",
      "title": "Route leak incident on January 22, 2026",
      "summary": "An automated routing policy configuration error caused us to leak some Border Gateway Protocol prefixes unintentionally from a router at our Miami data center. We discuss the impact and the changes we are implementing as a result.",
      "published_ts": 1769176800,
      "source_name": "Cloudflare Engineering",
      "content_type": "technical"
    },
    {
      "url": "https://engineering.salesforce.com/how-agentforce-data-and-apps-turned-the-salesforce-stack-into-agentforce-360/",
      "title": "How Agentforce, Data, and Apps Turned the Salesforce Stack into Agentforce 360",
      "summary": "In our Engineering Energizers Q&A series, we highlight the engineering minds driving innovation across Salesforce. Today, we feature Muralidhar Krishnaprasad (MK), President and CTO, C360 Platform, Apps, Industries, and Agentforce. His organization leads the unification of Salesforce’s core platform layers — data, agent, and applications — into a single, cohesive architecture that empowers real-time, AI-driven […] The post How Agentforce, Data, and Apps Turned the Salesforce Stack into Agentforce 360 appeared first on Salesforce Engineering Blog .",
      "published_ts": 1769107044,
      "source_name": "Salesforce Engineering",
      "content_type": "technical"
    },
    {
      "url": "https://www.snowflake.com/content/snowflake-site/global/en/blog/financial-services-predictions-2026",
      "title": "3 Predictions Shaping the Financial Services Industry in 2026",
      "summary": "Explore 3 predictions for financial services in 2026, from AI ROI and regulation to data, risk and operating model shifts in banking, insurance and fintech.",
      "published_ts": 1769101228,
      "source_name": "Snowflake Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.youtube.com/watch?v=2aVTVSxzPA4",
      "title": "Power BI Matrix Magic | Create Interactive Filters That Actually Work",
      "summary": "In this video, Patrick will walk through a real-world Power BI matrix challenge that looks simple on the surface—but quickly gets tricky once you factor in disconnected slicers, dynamic highlighting, row suppression, and correct totals ⚠️\n\n🔍 The problem:\n-  Products on rows\n-  Months on columns\n-  A disconnected month slicer\n- 🎯 Highlight the selected month column\n- 🚫 Hide products with no sales for the selected month\n- ➕ Totals must still be correct\n\nSounds easy… it’s not 😅\n\n🧠 What you’ll learn:\n- How to use a disconnected date table safely\n- A DAX pattern for 🎨 dynamic column highlighting\n- How to ❌ hide rows conditionally without breaking totals\n- Why ISINSCOPE matters for matrix logic\n- How to use REMOVEFILTERS correctly at both row and total levels\n\nA clean 🔁 return-path strategy for complex measures\n\nThis is a pattern you can reuse in real production models—especially when business users ask for “just one more thing” in a matrix 📊\n\nIf you enjoy deep Power BI DAX walkthroughs, matrix tricks, or real customer scenarios, make sure to 👍 subscribe and 💬 drop questions in the comments.\n\n⏱️ Chapters:\n00:00 – The business requirement\n00:50 – Model setup & disconnected slicer\n02:00 – Column highlighting with DAX\n03:00 – Suppressing rows & fixing totals\n05:00 – Final result & recap\n\n#PowerBI #DAX #MicrosoftFabric #DataAnalytics #BusinessIntelligence #PowerBIMatrix\n\n📢 Become a member: https://guyinacu.be/membership \n\n*******************\n\nWant to take your Power BI skills to the next level? We have training courses available to help you with your journey.\n\n🎓 Guy in a Cube courses: https://courses.guyinacube.com/\n\n*******************\nLET'S CONNECT!\n*******************\n\n-- https://bsky.app/profile/guyinacube.bsky.social\n-- http://twitter.com/guyinacube\n-- http://www.facebook.com/guyinacube\n\n\n#PowerBI #GuyInACube",
      "published_ts": 1769095802,
      "source_name": "Guy in a Cube (YouTube)",
      "content_type": "technical"
    },
    {
      "url": "https://www.databricks.com/blog/high-availability-feature-flagging-databricks",
      "title": "High-Availability Feature Flagging at Databricks",
      "summary": "Shipping software quickly while maintaining reliability is a constant tension. As...",
      "published_ts": 1769025600,
      "source_name": "Databricks Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.databricks.com/blog/building-regulatory-risk-copilot-databricks-agent-bricks-part-1-information-extraction",
      "title": "Building a Regulatory Risk Copilot with Databricks Agent Bricks (Part 1: Information Extraction)",
      "summary": "In July 2025, the US FDA publicly released an initial batch of 200+ Complete Response...",
      "published_ts": 1769025000,
      "source_name": "Databricks Blog",
      "content_type": "technical"
    },
    {
      "url": "https://airbyte.com/blog/open-agentic-data-infrastructure",
      "title": "Agentic Data Infrastructure Must Be Open | Airbyte",
      "summary": "Open agentic data infrastructure is essential for scalable, trustworthy AI—unlocking collaboration, transparency, and innovation.",
      "published_ts": 1768953600,
      "source_name": "Airbyte Blog",
      "content_type": "technical"
    },
    {
      "url": "https://airbyte.com/blog/how-open-source-powers-modern-ai",
      "title": "Open Source: The Innovation Engine Behind Modern AI | Airbyte",
      "summary": "Explore how open-source technologies have become the driving force behind modern artificial intelligence",
      "published_ts": 1768953600,
      "source_name": "Airbyte Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.dataengineeringweekly.com/p/data-contracts-a-missed-opportunity",
      "title": "Data Contracts: A Missed Opportunity",
      "summary": "The Conversation We Should Have Had—Before Thought Leadership Replaced System Design",
      "published_ts": 1768933870,
      "source_name": "Data Engineering Weekly",
      "content_type": "technical"
    },
    {
      "url": "https://huggingface.co/blog/waypoint-1",
      "title": "Introducing Waypoint-1: Real-time interactive video diffusion from Overworld",
      "summary": "Waypoint-1: Real-time Interactive Video Diffusion from\nOverworld\nTry Out The Model\nOverworld Stream:\nhttps://overworld.stream\nWhat is Waypoint-1?\nWaypoint-1 is Overworld’s real-time-interactive video diffusion model, controllable and prompted via text, mouse, and keyboard. You can give the model som",
      "published_ts": 1768867200,
      "source_name": "Hugging Face Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.dataengineeringweekly.com/p/data-engineering-weekly-253",
      "title": "Data Engineering Weekly #253",
      "summary": "The Weekly Data Engineering Newsletter",
      "published_ts": 1768800035,
      "source_name": "Data Engineering Weekly",
      "content_type": "technical"
    }
  ],
  "news_general": [],
  "python_analytics": [],
  "warehouses_engines": [
    {
      "url": "https://www.databricks.com/blog/announcing-first-class-support-iceberg-format-databricks-delta-sharing",
      "title": "Announcing first-class support of Iceberg format in Databricks Delta Sharing",
      "summary": "With more than 300% year-on-year usage growth for 2 consecutive years, Delta Sharing...",
      "published_ts": 1769195100,
      "source_name": "Databricks Blog",
      "content_type": "technical"
    },
    {
      "url": "https://duckdb.org/2026/01/23/duckdb-vortex-extension.html",
      "title": "Announcing Vortex Support in DuckDB",
      "summary": "Vortex is a new columnar file format with a very promising design. SpiralDB and DuckDB Labs have partnered to give you a very fast experience while reading and writing Vortex files!",
      "published_ts": 1769126400,
      "source_name": "DuckDB Blog",
      "content_type": "technical"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/modernize-your-data-warehouse-by-migrating-oracle-database-to-amazon-redshift-with-oracle-goldengate/",
      "title": "Modernize your data warehouse by migrating Oracle Database to Amazon Redshift with Oracle GoldenGate",
      "summary": "In this post, we show how to migrate an Oracle data warehouse to Amazon Redshift using Oracle GoldenGate and DMS Schema Conversion, a feature of AWS Database Migration Service (AWS DMS). This approach facilitates minimal business disruption through continuous replication.",
      "published_ts": 1769102909,
      "source_name": "Redshift / AWS Big Data",
      "content_type": "technical"
    },
    {
      "url": "https://aws.amazon.com/blogs/big-data/power-up-your-analytics-with-amazon-sagemaker-unified-studio-integration-with-tableau-power-bi-and-more/",
      "title": "Power up your analytics with Amazon SageMaker Unified Studio integration with Tableau, Power BI, and more",
      "summary": "In this post, we guide you through connecting various analytics tools to Amazon SageMaker Unified Studio using the Athena JDBC driver, enabling seamless access to your subscribed data within your Amazon SageMaker Unified Studio projects.",
      "published_ts": 1769102769,
      "source_name": "Redshift / AWS Big Data",
      "content_type": "technical"
    },
    {
      "url": "https://www.getdbt.com/blog/dbt-fusion-cost-efficiency",
      "title": "29%+ warehouse savings: How the dbt Fusion engine drives cost efficiency",
      "summary": "You’re probably overspending on data compute. We know we were. Here’s how we fixed it.",
      "published_ts": 1769024400,
      "source_name": "dbt Blog",
      "content_type": "technical"
    },
    {
      "url": "https://www.databricks.com/blog/alchemist-brickbuilder-databricks-marketplace-app",
      "title": "Alchemist: from Brickbuilder to a Databricks Marketplace App",
      "summary": "For nearly six years, T1A has partnered with Databricks to end-to-end SAS-to-Databricks...",
      "published_ts": 1768956000,
      "source_name": "Databricks Blog",
      "content_type": "technical"
    }
  ]
}